ranjithaguna/pv/LED_Demo/source/pic32cx/component/i2c.h
/**
 * \brief Component description for PIC32CX/0525SG12 I2C
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_I2C_COMPONENT_H_
#define _PIC32CX_0525SG12_I2C_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_I2C The I2C interface can handle standard I2C interface.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR I2C */
/* ========================================================================== */

/* -------- I2C_CONTROL : (I2C Offset: 0x00) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t ACK:1;                     /**< bit:      0  The Acknowledge bit (ACK) must normally be asserted ('1'). This causes the controller to send an acknowledge automatically after each byte (this occurs during the 9th clock pulse). The ACK bit must not be asserted ('0') when the controller is operating in master/receiver mode and requires no further data to be sent from the slave transmitter. This causes a negative acknowledge on the I2C bus, which halts further transmission from the slave device. */
    uint32_t STO:1;                     /**< bit:      1  See STA description                           */
    uint32_t STA:1;                     /**< bit:      2  The STA and STO bits control the generation of the I2C Start condition and the transmission of the Slave Address and R/nW bit (from the Data Register), generation of repeated Start condition, and generation of the Stop condition */
    uint32_t ENI:1;                     /**< bit:      3  Enable Interrupt bit (ENI) controls the Interrupt Interface */
    uint32_t :2;                        /**< bit:   4..5  Reserved                                      */
    uint32_t ESO:1;                     /**< bit:      6  The Enable Serial Output bit (ESO) enables and disables the SMB Controller Core serial data output (SDAT) */
    uint32_t PIN:1;                     /**< bit:      7  The Pending Interrupt Not (PIN) bit serves as a software reset function. Writing the PIN bit to a logic '1' de-asserts all status bits except for the nBB bit which is not affected by the PIN bit. The PIN bit is a self-clearing bit. Writing this bit to a logic '0' has no effect. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __I2C_CONTROL_bits_t;
#define I2C_CONTROL_RESETVALUE              (0x00U)                                       /**<  (I2C_CONTROL) Control Register  Reset Value */

#define I2C_CONTROL_ACK_Pos                   (0)                                            /**< (I2C_CONTROL) The Acknowledge bit (ACK) must normally be asserted ('1'). This causes the controller to send an acknowledge automatically after each byte (this occurs during the 9th clock pulse). The ACK bit must not be asserted ('0') when the controller is operating in master/receiver mode and requires no further data to be sent from the slave transmitter. This causes a negative acknowledge on the I2C bus, which halts further transmission from the slave device. Position */
#define I2C_CONTROL_ACK_Msk                   (0x1U << I2C_CONTROL_ACK_Pos)                  /**< (I2C_CONTROL) The Acknowledge bit (ACK) must normally be asserted ('1'). This causes the controller to send an acknowledge automatically after each byte (this occurs during the 9th clock pulse). The ACK bit must not be asserted ('0') when the controller is operating in master/receiver mode and requires no further data to be sent from the slave transmitter. This causes a negative acknowledge on the I2C bus, which halts further transmission from the slave device. Mask */
#define I2C_CONTROL_STO_Pos                   (1)                                            /**< (I2C_CONTROL) See STA description Position */
#define I2C_CONTROL_STO_Msk                   (0x1U << I2C_CONTROL_STO_Pos)                  /**< (I2C_CONTROL) See STA description Mask */
#define I2C_CONTROL_STA_Pos                   (2)                                            /**< (I2C_CONTROL) The STA and STO bits control the generation of the I2C Start condition and the transmission of the Slave Address and R/nW bit (from the Data Register), generation of repeated Start condition, and generation of the Stop condition Position */
#define I2C_CONTROL_STA_Msk                   (0x1U << I2C_CONTROL_STA_Pos)                  /**< (I2C_CONTROL) The STA and STO bits control the generation of the I2C Start condition and the transmission of the Slave Address and R/nW bit (from the Data Register), generation of repeated Start condition, and generation of the Stop condition Mask */
#define I2C_CONTROL_ENI_Pos                   (3)                                            /**< (I2C_CONTROL) Enable Interrupt bit (ENI) controls the Interrupt Interface Position */
#define I2C_CONTROL_ENI_Msk                   (0x1U << I2C_CONTROL_ENI_Pos)                  /**< (I2C_CONTROL) Enable Interrupt bit (ENI) controls the Interrupt Interface Mask */
#define I2C_CONTROL_ESO_Pos                   (6)                                            /**< (I2C_CONTROL) The Enable Serial Output bit (ESO) enables and disables the SMB Controller Core serial data output (SDAT) Position */
#define I2C_CONTROL_ESO_Msk                   (0x1U << I2C_CONTROL_ESO_Pos)                  /**< (I2C_CONTROL) The Enable Serial Output bit (ESO) enables and disables the SMB Controller Core serial data output (SDAT) Mask */
#define I2C_CONTROL_PIN_Pos                   (7)                                            /**< (I2C_CONTROL) The Pending Interrupt Not (PIN) bit serves as a software reset function. Writing the PIN bit to a logic '1' de-asserts all status bits except for the nBB bit which is not affected by the PIN bit. The PIN bit is a self-clearing bit. Writing this bit to a logic '0' has no effect. Position */
#define I2C_CONTROL_PIN_Msk                   (0x1U << I2C_CONTROL_PIN_Pos)                  /**< (I2C_CONTROL) The Pending Interrupt Not (PIN) bit serves as a software reset function. Writing the PIN bit to a logic '1' de-asserts all status bits except for the nBB bit which is not affected by the PIN bit. The PIN bit is a self-clearing bit. Writing this bit to a logic '0' has no effect. Mask */
#define I2C_CONTROL_Msk                       (0x000000CFUL)                                 /**< (I2C_CONTROL) Register Mask  */

/* -------- I2C_STATUS : (I2C Offset: 0x00) (R/ 32) Status Register -------- */

typedef union
{
  struct
  {
    uint32_t NBB:1;                     /**< bit:      0  The Bus Busy bit (NBB) is a read-only flag indicating when the bus is in use. A zero indicates that the bus is busy and access is not possible. */
    uint32_t LAB:1;                     /**< bit:      1  The Lost Arbitration Bit (LAB) is set when, in multi-master operation, arbitration is lost to another master on the bus */
    uint32_t AAS:1;                     /**< bit:      2  The Addressed As Slave bit (AAS) is valid only when PIN is asserted ('0'). When acting as slave, AAS is set when an incoming address over the bus matches the value in the Own Address Register or if the 'general call' address (00h) has been received */
    uint32_t LRB_AD0:1;                 /**< bit:      3  The (Last Received Bit)  or (Address 0) (general call) bit (LRB/AD0) serves a dual function and is valid only while the PIN bit is asserted ('0').\n                When the AAS bit is not asserted ('0') (i.e., not addressed as a slave), the LRB/AD0 holds the value of the last received bit over the bus.\n                When the AAS bit is asserted ('1') (i.e., addressed as slave), the SMB Controller Core has been addressed as a slave. */
    uint32_t BER:1;                     /**< bit:      4  When Bus Error (BER) is asserted, a misplaced START or STOP condition or Bus Time-Outs have been detected. */
    uint32_t STS:1;                     /**< bit:      5  When in slave receiver mode, STS is asserted ('1') when an externally generated STOP condition is detected. Note that STS is used only in slave receiver mode. */
    uint32_t SAD:1;                     /**< bit:      6  SMBus Address Decoded (SAD)                   */
    uint32_t PIN:1;                     /**< bit:      7  Pending Interrupt bit                         */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __I2C_STATUS_bits_t;
#define I2C_STATUS_RESETVALUE               (0x00U)                                       /**<  (I2C_STATUS) Status Register  Reset Value */

#define I2C_STATUS_NBB_Pos                    (0)                                            /**< (I2C_STATUS) The Bus Busy bit (NBB) is a read-only flag indicating when the bus is in use. A zero indicates that the bus is busy and access is not possible. Position */
#define I2C_STATUS_NBB_Msk                    (0x1U << I2C_STATUS_NBB_Pos)                   /**< (I2C_STATUS) The Bus Busy bit (NBB) is a read-only flag indicating when the bus is in use. A zero indicates that the bus is busy and access is not possible. Mask */
#define I2C_STATUS_LAB_Pos                    (1)                                            /**< (I2C_STATUS) The Lost Arbitration Bit (LAB) is set when, in multi-master operation, arbitration is lost to another master on the bus Position */
#define I2C_STATUS_LAB_Msk                    (0x1U << I2C_STATUS_LAB_Pos)                   /**< (I2C_STATUS) The Lost Arbitration Bit (LAB) is set when, in multi-master operation, arbitration is lost to another master on the bus Mask */
#define I2C_STATUS_AAS_Pos                    (2)                                            /**< (I2C_STATUS) The Addressed As Slave bit (AAS) is valid only when PIN is asserted ('0'). When acting as slave, AAS is set when an incoming address over the bus matches the value in the Own Address Register or if the 'general call' address (00h) has been received Position */
#define I2C_STATUS_AAS_Msk                    (0x1U << I2C_STATUS_AAS_Pos)                   /**< (I2C_STATUS) The Addressed As Slave bit (AAS) is valid only when PIN is asserted ('0'). When acting as slave, AAS is set when an incoming address over the bus matches the value in the Own Address Register or if the 'general call' address (00h) has been received Mask */
#define I2C_STATUS_LRB_AD0_Pos                (3)                                            /**< (I2C_STATUS) The (Last Received Bit)  or (Address 0) (general call) bit (LRB/AD0) serves a dual function and is valid only while the PIN bit is asserted ('0').\n                When the AAS bit is not asserted ('0') (i.e., not addressed as a slave), the LRB/AD0 holds the value of the last received bit over the bus.\n                When the AAS bit is asserted ('1') (i.e., addressed as slave), the SMB Controller Core has been addressed as a slave. Position */
#define I2C_STATUS_LRB_AD0_Msk                (0x1U << I2C_STATUS_LRB_AD0_Pos)               /**< (I2C_STATUS) The (Last Received Bit)  or (Address 0) (general call) bit (LRB/AD0) serves a dual function and is valid only while the PIN bit is asserted ('0').\n                When the AAS bit is not asserted ('0') (i.e., not addressed as a slave), the LRB/AD0 holds the value of the last received bit over the bus.\n                When the AAS bit is asserted ('1') (i.e., addressed as slave), the SMB Controller Core has been addressed as a slave. Mask */
#define I2C_STATUS_BER_Pos                    (4)                                            /**< (I2C_STATUS) When Bus Error (BER) is asserted, a misplaced START or STOP condition or Bus Time-Outs have been detected. Position */
#define I2C_STATUS_BER_Msk                    (0x1U << I2C_STATUS_BER_Pos)                   /**< (I2C_STATUS) When Bus Error (BER) is asserted, a misplaced START or STOP condition or Bus Time-Outs have been detected. Mask */
#define I2C_STATUS_STS_Pos                    (5)                                            /**< (I2C_STATUS) When in slave receiver mode, STS is asserted ('1') when an externally generated STOP condition is detected. Note that STS is used only in slave receiver mode. Position */
#define I2C_STATUS_STS_Msk                    (0x1U << I2C_STATUS_STS_Pos)                   /**< (I2C_STATUS) When in slave receiver mode, STS is asserted ('1') when an externally generated STOP condition is detected. Note that STS is used only in slave receiver mode. Mask */
#define I2C_STATUS_SAD_Pos                    (6)                                            /**< (I2C_STATUS) SMBus Address Decoded (SAD) Position */
#define I2C_STATUS_SAD_Msk                    (0x1U << I2C_STATUS_SAD_Pos)                   /**< (I2C_STATUS) SMBus Address Decoded (SAD) Mask */
#define I2C_STATUS_PIN_Pos                    (7)                                            /**< (I2C_STATUS) Pending Interrupt bit Position */
#define I2C_STATUS_PIN_Msk                    (0x1U << I2C_STATUS_PIN_Pos)                   /**< (I2C_STATUS) Pending Interrupt bit Mask */
#define I2C_STATUS_Msk                        (0x000000FFUL)                                 /**< (I2C_STATUS) Register Mask  */

/* -------- I2C_OWN : (I2C Offset: 0x04) (R/W 32) Own Address Register\n           Note that the Data Register and Own Address fields are offset by one bit, so that programming Own Address 1 with a value of 55h will result in the value AAh being recognized as the SMB Controller Core slave address. -------- */

typedef union
{
  struct
  {
    uint32_t OWN_ADDRESS_1:7;           /**< bit:   0..6  The Own Address 1 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t OWN_ADDRESS_2:7;           /**< bit:  8..14  The Own Address 2 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __I2C_OWN_bits_t;
#define I2C_OWN_RESETVALUE                  (0x00U)                                       /**<  (I2C_OWN) Own Address Register\n           Note that the Data Register and Own Address fields are offset by one bit, so that programming Own Address 1 with a value of 55h will result in the value AAh being recognized as the SMB Controller Core slave address.  Reset Value */

