ranjithaguna/pv/LED_Demo/source/pic32cx/component/i2c.h
#define I2C_OWN_OWN_ADDRESS_1_Pos             (0)                                            /**< (I2C_OWN) The Own Address 1 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. Position */
#define I2C_OWN_OWN_ADDRESS_1_Msk             (0x7FU << I2C_OWN_OWN_ADDRESS_1_Pos)           /**< (I2C_OWN) The Own Address 1 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. Mask */
#define I2C_OWN_OWN_ADDRESS_1(value)          (I2C_OWN_OWN_ADDRESS_1_Msk & ((value) << I2C_OWN_OWN_ADDRESS_1_Pos))
#define I2C_OWN_OWN_ADDRESS_2_Pos             (8)                                            /**< (I2C_OWN) The Own Address 2 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. Position */
#define I2C_OWN_OWN_ADDRESS_2_Msk             (0x7FU << I2C_OWN_OWN_ADDRESS_2_Pos)           /**< (I2C_OWN) The Own Address 2 bits configure one of the two addresses to which the SMB Controller Core will respond when addressed as a slave. Mask */
#define I2C_OWN_OWN_ADDRESS_2(value)          (I2C_OWN_OWN_ADDRESS_2_Msk & ((value) << I2C_OWN_OWN_ADDRESS_2_Pos))
#define I2C_OWN_Msk                           (0x00007F7FUL)                                 /**< (I2C_OWN) Register Mask  */

/* -------- I2C_DATA_REG : (I2C Offset: 0x08) (R/W 8) This register holds the data that are either shifted out to or shifted in from the I2C port. -------- */

typedef union
{
  uint8_t  w;
} __I2C_DATA_REG_bits_t;
#define I2C_DATA_REG_RESETVALUE             (0x00U)                                       /**<  (I2C_DATA_REG) This register holds the data that are either shifted out to or shifted in from the I2C port.  Reset Value */

#define I2C_DATA_REG_Msk                      (0x00000000UL)                                 /**< (I2C_DATA_REG) Register Mask  */

/* -------- I2C_REPEATED_START_HOLD_TIME : (I2C Offset: 0x18) (R/W 32) Repeated Start Hold Time Register -------- */

typedef union
{
  struct
  {
    uint32_t RPT_START_HOLD_TIME:8;     /**< bit:   0..7  This is the value of the timing requirement tHd:Sta in the I2C specification for a repeated START bit. This is used to hold\n      the clock until the Hold Time for the repeated Start Bit has been satisfied. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __I2C_REPEATED_START_HOLD_TIME_bits_t;
#define I2C_REPEATED_START_HOLD_TIME_RESETVALUE (0x4DU)                                       /**<  (I2C_REPEATED_START_HOLD_TIME) Repeated Start Hold Time Register  Reset Value */

#define I2C_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME_Pos (0)                                            /**< (I2C_REPEATED_START_HOLD_TIME) This is the value of the timing requirement tHd:Sta in the I2C specification for a repeated START bit. This is used to hold\n      the clock until the Hold Time for the repeated Start Bit has been satisfied. Position */
#define I2C_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME_Msk (0xFFU << I2C_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME_Pos)  /**< (I2C_REPEATED_START_HOLD_TIME) This is the value of the timing requirement tHd:Sta in the I2C specification for a repeated START bit. This is used to hold\n      the clock until the Hold Time for the repeated Start Bit has been satisfied. Mask */
#define I2C_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME(value) (I2C_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME_Msk & ((value) << I2C_REPEATED_START_HOLD_TIME_RPT_START_HOLD_TIME_Pos))
#define I2C_REPEATED_START_HOLD_TIME_Msk      (0x000000FFUL)                                 /**< (I2C_REPEATED_START_HOLD_TIME) Register Mask  */

/* -------- I2C_COMPLETION : (I2C Offset: 0x20) (R/W 32) Completion Register -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t DTEN:1;                    /**< bit:      2  When DTEN is asserted ('1'), Device Time-out checking is enabled. When DTEN is not asserted ('0'), Device Time-out checking is disabled. */
    uint32_t MCEN:1;                    /**< bit:      3  When MCEN is asserted ('1'), Master Cumulative Time-Out checking is enabled. When MCEN is not asserted ('0'), Master Cumulative Time-Out checking is disabled. */
    uint32_t SCEN:1;                    /**< bit:      4  When SCEN is asserted ('1'), Slave Cumulative Time-Out checking is enabled. When SCEN is not asserted ('0'), Slave Cumulative Time-Out checking is disabled. */
    uint32_t BIDEN:1;                   /**< bit:      5  When BIDEN is asserted ('1'), Bus Idle Detect Time-Out checking is enabled. When BIDEN is not asserted ('0'), Bus Idle Detect Time-Out checking is disabled. */
    uint32_t TIMERR:1;                  /**< bit:      6  The Time-out Error Detected bit (TIMERR) is asserted ('1') whenever any of the enabled time-out error detect status bits (CHDH, CHDL, SCTO, MCTO and DTO) are asserted. */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t DTO:1;                     /**< bit:      8  DTO is the Device Time-out bit. (R/WC)        */
    uint32_t MCTO:1;                    /**< bit:      9  MCTO is the Master Cumulative Time-out bit. (R/WC) */
    uint32_t SCTO:1;                    /**< bit:     10  SCTO is the Slave Cumulative Time-out bit(R/WC) */
    uint32_t CHDL:1;                    /**< bit:     11  CHDL is the clock high time-out detect bit(R/WC) */
    uint32_t CHDH:1;                    /**< bit:     12  CHDH is the bus idle time-out detect bit(R/WC) */
    uint32_t :19;                       /**< bit: 13..31  Reserved                                      */
  };
  uint32_t w;
} __I2C_COMPLETION_bits_t;
#define I2C_COMPLETION_RESETVALUE           (0x00U)                                       /**<  (I2C_COMPLETION) Completion Register  Reset Value */

