ranjithaguna/pv/LED_Demo/source/pic32cx/component/i2c.h
#define I2C_COMPLETION_DTEN_Pos               (2)                                            /**< (I2C_COMPLETION) When DTEN is asserted ('1'), Device Time-out checking is enabled. When DTEN is not asserted ('0'), Device Time-out checking is disabled. Position */
#define I2C_COMPLETION_DTEN_Msk               (0x1U << I2C_COMPLETION_DTEN_Pos)              /**< (I2C_COMPLETION) When DTEN is asserted ('1'), Device Time-out checking is enabled. When DTEN is not asserted ('0'), Device Time-out checking is disabled. Mask */
#define I2C_COMPLETION_MCEN_Pos               (3)                                            /**< (I2C_COMPLETION) When MCEN is asserted ('1'), Master Cumulative Time-Out checking is enabled. When MCEN is not asserted ('0'), Master Cumulative Time-Out checking is disabled. Position */
#define I2C_COMPLETION_MCEN_Msk               (0x1U << I2C_COMPLETION_MCEN_Pos)              /**< (I2C_COMPLETION) When MCEN is asserted ('1'), Master Cumulative Time-Out checking is enabled. When MCEN is not asserted ('0'), Master Cumulative Time-Out checking is disabled. Mask */
#define I2C_COMPLETION_SCEN_Pos               (4)                                            /**< (I2C_COMPLETION) When SCEN is asserted ('1'), Slave Cumulative Time-Out checking is enabled. When SCEN is not asserted ('0'), Slave Cumulative Time-Out checking is disabled. Position */
#define I2C_COMPLETION_SCEN_Msk               (0x1U << I2C_COMPLETION_SCEN_Pos)              /**< (I2C_COMPLETION) When SCEN is asserted ('1'), Slave Cumulative Time-Out checking is enabled. When SCEN is not asserted ('0'), Slave Cumulative Time-Out checking is disabled. Mask */
#define I2C_COMPLETION_BIDEN_Pos              (5)                                            /**< (I2C_COMPLETION) When BIDEN is asserted ('1'), Bus Idle Detect Time-Out checking is enabled. When BIDEN is not asserted ('0'), Bus Idle Detect Time-Out checking is disabled. Position */
#define I2C_COMPLETION_BIDEN_Msk              (0x1U << I2C_COMPLETION_BIDEN_Pos)             /**< (I2C_COMPLETION) When BIDEN is asserted ('1'), Bus Idle Detect Time-Out checking is enabled. When BIDEN is not asserted ('0'), Bus Idle Detect Time-Out checking is disabled. Mask */
#define I2C_COMPLETION_TIMERR_Pos             (6)                                            /**< (I2C_COMPLETION) The Time-out Error Detected bit (TIMERR) is asserted ('1') whenever any of the enabled time-out error detect status bits (CHDH, CHDL, SCTO, MCTO and DTO) are asserted. Position */
#define I2C_COMPLETION_TIMERR_Msk             (0x1U << I2C_COMPLETION_TIMERR_Pos)            /**< (I2C_COMPLETION) The Time-out Error Detected bit (TIMERR) is asserted ('1') whenever any of the enabled time-out error detect status bits (CHDH, CHDL, SCTO, MCTO and DTO) are asserted. Mask */
#define I2C_COMPLETION_DTO_Pos                (8)                                            /**< (I2C_COMPLETION) DTO is the Device Time-out bit. (R/WC) Position */
#define I2C_COMPLETION_DTO_Msk                (0x1U << I2C_COMPLETION_DTO_Pos)               /**< (I2C_COMPLETION) DTO is the Device Time-out bit. (R/WC) Mask */
#define I2C_COMPLETION_MCTO_Pos               (9)                                            /**< (I2C_COMPLETION) MCTO is the Master Cumulative Time-out bit. (R/WC) Position */
#define I2C_COMPLETION_MCTO_Msk               (0x1U << I2C_COMPLETION_MCTO_Pos)              /**< (I2C_COMPLETION) MCTO is the Master Cumulative Time-out bit. (R/WC) Mask */
#define I2C_COMPLETION_SCTO_Pos               (10)                                           /**< (I2C_COMPLETION) SCTO is the Slave Cumulative Time-out bit(R/WC) Position */
#define I2C_COMPLETION_SCTO_Msk               (0x1U << I2C_COMPLETION_SCTO_Pos)              /**< (I2C_COMPLETION) SCTO is the Slave Cumulative Time-out bit(R/WC) Mask */
#define I2C_COMPLETION_CHDL_Pos               (11)                                           /**< (I2C_COMPLETION) CHDL is the clock high time-out detect bit(R/WC) Position */
#define I2C_COMPLETION_CHDL_Msk               (0x1U << I2C_COMPLETION_CHDL_Pos)              /**< (I2C_COMPLETION) CHDL is the clock high time-out detect bit(R/WC) Mask */
#define I2C_COMPLETION_CHDH_Pos               (12)                                           /**< (I2C_COMPLETION) CHDH is the bus idle time-out detect bit(R/WC) Position */
#define I2C_COMPLETION_CHDH_Msk               (0x1U << I2C_COMPLETION_CHDH_Pos)              /**< (I2C_COMPLETION) CHDH is the bus idle time-out detect bit(R/WC) Mask */
#define I2C_COMPLETION_Msk                    (0x00001F7CUL)                                 /**< (I2C_COMPLETION) Register Mask  */

/* -------- I2C_CONFIGURATION : (I2C Offset: 0x28) (R/W 32) Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t PORT_SEL:4;                /**< bit:   0..3  The PORT SEL [3:0] bits determine which one of 16 possible bus ports apply to the active 2-wire SDAT and SCLK bus pair. */
    uint32_t TCEN:1;                    /**< bit:      4  When the Timing Check Enable bit (TCEN) is asserted ('1'), Bus Time-Outs are enabled */
    uint32_t SLOW_CLOCK:1;              /**< bit:      5  When this bit is 1, the base period for the Bus Clock Register is multiplied by 4, and thus the frequency is divided by 4. */
    uint32_t TEST:1;                    /**< bit:      6  Must be always written with 0.                */
    uint32_t PECEN:1;                   /**< bit:      7  When the PEC Enable bit (PECEN) is asserted ('1'), Hardware PEC Support is enabled */
    uint32_t FEN:1;                     /**< bit:      8  Input filtering enable. Input filtering is required by the I2C specification if external filtering is not available.\n      1=Input filtering is enabled; 0=Input filtering is disabled. */
    uint32_t RESET:1;                   /**< bit:      9  When RESET is asserted ('1'), all logic and registers except for the RESET bit itself are initialized to the power-on default state. */
    uint32_t ENAB:1;                    /**< bit:     10  When ENAB (Enable) is not asserted ('0') (default), the SMB Controller Core is disabled and in the lowest power consumption state (Disabled State).\n                The ENAB bit must be asserted ('1') for normal operation. */
    uint32_t DSA:1;                     /**< bit:     11  0: Slave Address I2C Compatibility Mode (default). 1: SMBus Address Decode Mode */
    uint32_t FAIR:1;                    /**< bit:     12  If this bit is 1, the MCTP Fairness protocol is in effect. */
    uint32_t TEST0:1;                   /**< bit:     13  Must be always written with 0.                */
    uint32_t GC_DIS:1;                  /**< bit:     14  This is the General Call Disable bit.\n                0: the response to the General Call address as a slave is enabled\n                1: the response to the General Call address as a slave is disabled. */
    uint32_t CNFG_PROMISCUOUS:1;        /**< bit:     15  This is the configur Promiscuous bit.\n                0: Normal operation is enabled. \n         1: Promiscuous Mode enabled , General Call Address disabled, Promiscuous Address Interrupt function enabled.    Stall 9th clock of address byte enabled.  Address byte ACK/NAK done by Promiscuous ACK setting.\n */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __I2C_CONFIGURATION_bits_t;
