ranjithaguna/pv/LED_Demo/source/pic32cx/component/i2c.h
#define I2C_CONFIGURATION_RESETVALUE        (0x00U)                                       /**<  (I2C_CONFIGURATION) Configuration Register  Reset Value */

#define I2C_CONFIGURATION_PORT_SEL_Pos        (0)                                            /**< (I2C_CONFIGURATION) The PORT SEL [3:0] bits determine which one of 16 possible bus ports apply to the active 2-wire SDAT and SCLK bus pair. Position */
#define I2C_CONFIGURATION_PORT_SEL_Msk        (0xFU << I2C_CONFIGURATION_PORT_SEL_Pos)       /**< (I2C_CONFIGURATION) The PORT SEL [3:0] bits determine which one of 16 possible bus ports apply to the active 2-wire SDAT and SCLK bus pair. Mask */
#define I2C_CONFIGURATION_PORT_SEL(value)     (I2C_CONFIGURATION_PORT_SEL_Msk & ((value) << I2C_CONFIGURATION_PORT_SEL_Pos))
#define I2C_CONFIGURATION_TCEN_Pos            (4)                                            /**< (I2C_CONFIGURATION) When the Timing Check Enable bit (TCEN) is asserted ('1'), Bus Time-Outs are enabled Position */
#define I2C_CONFIGURATION_TCEN_Msk            (0x1U << I2C_CONFIGURATION_TCEN_Pos)           /**< (I2C_CONFIGURATION) When the Timing Check Enable bit (TCEN) is asserted ('1'), Bus Time-Outs are enabled Mask */
#define I2C_CONFIGURATION_SLOW_CLOCK_Pos      (5)                                            /**< (I2C_CONFIGURATION) When this bit is 1, the base period for the Bus Clock Register is multiplied by 4, and thus the frequency is divided by 4. Position */
#define I2C_CONFIGURATION_SLOW_CLOCK_Msk      (0x1U << I2C_CONFIGURATION_SLOW_CLOCK_Pos)     /**< (I2C_CONFIGURATION) When this bit is 1, the base period for the Bus Clock Register is multiplied by 4, and thus the frequency is divided by 4. Mask */
#define I2C_CONFIGURATION_TEST_Pos            (6)                                            /**< (I2C_CONFIGURATION) Must be always written with 0. Position */
#define I2C_CONFIGURATION_TEST_Msk            (0x1U << I2C_CONFIGURATION_TEST_Pos)           /**< (I2C_CONFIGURATION) Must be always written with 0. Mask */
#define I2C_CONFIGURATION_PECEN_Pos           (7)                                            /**< (I2C_CONFIGURATION) When the PEC Enable bit (PECEN) is asserted ('1'), Hardware PEC Support is enabled Position */
#define I2C_CONFIGURATION_PECEN_Msk           (0x1U << I2C_CONFIGURATION_PECEN_Pos)          /**< (I2C_CONFIGURATION) When the PEC Enable bit (PECEN) is asserted ('1'), Hardware PEC Support is enabled Mask */
#define I2C_CONFIGURATION_FEN_Pos             (8)                                            /**< (I2C_CONFIGURATION) Input filtering enable. Input filtering is required by the I2C specification if external filtering is not available.\n      1=Input filtering is enabled; 0=Input filtering is disabled. Position */
#define I2C_CONFIGURATION_FEN_Msk             (0x1U << I2C_CONFIGURATION_FEN_Pos)            /**< (I2C_CONFIGURATION) Input filtering enable. Input filtering is required by the I2C specification if external filtering is not available.\n      1=Input filtering is enabled; 0=Input filtering is disabled. Mask */
#define I2C_CONFIGURATION_RESET_Pos           (9)                                            /**< (I2C_CONFIGURATION) When RESET is asserted ('1'), all logic and registers except for the RESET bit itself are initialized to the power-on default state. Position */
#define I2C_CONFIGURATION_RESET_Msk           (0x1U << I2C_CONFIGURATION_RESET_Pos)          /**< (I2C_CONFIGURATION) When RESET is asserted ('1'), all logic and registers except for the RESET bit itself are initialized to the power-on default state. Mask */
#define I2C_CONFIGURATION_ENAB_Pos            (10)                                           /**< (I2C_CONFIGURATION) When ENAB (Enable) is not asserted ('0') (default), the SMB Controller Core is disabled and in the lowest power consumption state (Disabled State).\n                The ENAB bit must be asserted ('1') for normal operation. Position */
#define I2C_CONFIGURATION_ENAB_Msk            (0x1U << I2C_CONFIGURATION_ENAB_Pos)           /**< (I2C_CONFIGURATION) When ENAB (Enable) is not asserted ('0') (default), the SMB Controller Core is disabled and in the lowest power consumption state (Disabled State).\n                The ENAB bit must be asserted ('1') for normal operation. Mask */
#define I2C_CONFIGURATION_DSA_Pos             (11)                                           /**< (I2C_CONFIGURATION) 0: Slave Address I2C Compatibility Mode (default). 1: SMBus Address Decode Mode Position */
#define I2C_CONFIGURATION_DSA_Msk             (0x1U << I2C_CONFIGURATION_DSA_Pos)            /**< (I2C_CONFIGURATION) 0: Slave Address I2C Compatibility Mode (default). 1: SMBus Address Decode Mode Mask */
#define I2C_CONFIGURATION_FAIR_Pos            (12)                                           /**< (I2C_CONFIGURATION) If this bit is 1, the MCTP Fairness protocol is in effect. Position */
#define I2C_CONFIGURATION_FAIR_Msk            (0x1U << I2C_CONFIGURATION_FAIR_Pos)           /**< (I2C_CONFIGURATION) If this bit is 1, the MCTP Fairness protocol is in effect. Mask */
#define I2C_CONFIGURATION_TEST0_Pos           (13)                                           /**< (I2C_CONFIGURATION) Must be always written with 0. Position */
#define I2C_CONFIGURATION_TEST0_Msk           (0x1U << I2C_CONFIGURATION_TEST0_Pos)          /**< (I2C_CONFIGURATION) Must be always written with 0. Mask */
#define I2C_CONFIGURATION_GC_DIS_Pos          (14)                                           /**< (I2C_CONFIGURATION) This is the General Call Disable bit.\n                0: the response to the General Call address as a slave is enabled\n                1: the response to the General Call address as a slave is disabled. Position */
#define I2C_CONFIGURATION_GC_DIS_Msk          (0x1U << I2C_CONFIGURATION_GC_DIS_Pos)         /**< (I2C_CONFIGURATION) This is the General Call Disable bit.\n                0: the response to the General Call address as a slave is enabled\n                1: the response to the General Call address as a slave is disabled. Mask */
#define I2C_CONFIGURATION_CNFG_PROMISCUOUS_Pos (15)                                           /**< (I2C_CONFIGURATION) This is the configur Promiscuous bit.\n                0: Normal operation is enabled. \n         1: Promiscuous Mode enabled , General Call Address disabled, Promiscuous Address Interrupt function enabled.    Stall 9th clock of address byte enabled.  Address byte ACK/NAK done by Promiscuous ACK setting.\n Position */
#define I2C_CONFIGURATION_CNFG_PROMISCUOUS_Msk (0x1U << I2C_CONFIGURATION_CNFG_PROMISCUOUS_Pos)  /**< (I2C_CONFIGURATION) This is the configur Promiscuous bit.\n                0: Normal operation is enabled. \n         1: Promiscuous Mode enabled , General Call Address disabled, Promiscuous Address Interrupt function enabled.    Stall 9th clock of address byte enabled.  Address byte ACK/NAK done by Promiscuous ACK setting.\n Mask */
#define I2C_CONFIGURATION_Msk                 (0x0000FFFFUL)                                 /**< (I2C_CONFIGURATION) Register Mask  */

/* -------- I2C_BUS_CLOCK : (I2C Offset: 0x2c) (R/W 32) Bus Clock Register -------- */

typedef union
{
  struct
  {
    uint32_t LOW_PERIOD:8;              /**< bit:   0..7  This field defines the number of I2C Baud Clock periods that make up the low phase of the I2C/SMBus bus clock. */
    uint32_t HIGH_PERIOD:8;             /**< bit:  8..15  This field defines the number of I2C Baud Clock periods that make up the high phase of the I2C/SMBus bus clock. */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __I2C_BUS_CLOCK_bits_t;
#define I2C_BUS_CLOCK_RESETVALUE            (0x4F4FU)                                     /**<  (I2C_BUS_CLOCK) Bus Clock Register  Reset Value */

#define I2C_BUS_CLOCK_LOW_PERIOD_Pos          (0)                                            /**< (I2C_BUS_CLOCK) This field defines the number of I2C Baud Clock periods that make up the low phase of the I2C/SMBus bus clock. Position */
#define I2C_BUS_CLOCK_LOW_PERIOD_Msk          (0xFFU << I2C_BUS_CLOCK_LOW_PERIOD_Pos)        /**< (I2C_BUS_CLOCK) This field defines the number of I2C Baud Clock periods that make up the low phase of the I2C/SMBus bus clock. Mask */
#define I2C_BUS_CLOCK_LOW_PERIOD(value)       (I2C_BUS_CLOCK_LOW_PERIOD_Msk & ((value) << I2C_BUS_CLOCK_LOW_PERIOD_Pos))
#define I2C_BUS_CLOCK_HIGH_PERIOD_Pos         (8)                                            /**< (I2C_BUS_CLOCK) This field defines the number of I2C Baud Clock periods that make up the high phase of the I2C/SMBus bus clock. Position */
#define I2C_BUS_CLOCK_HIGH_PERIOD_Msk         (0xFFU << I2C_BUS_CLOCK_HIGH_PERIOD_Pos)       /**< (I2C_BUS_CLOCK) This field defines the number of I2C Baud Clock periods that make up the high phase of the I2C/SMBus bus clock. Mask */
#define I2C_BUS_CLOCK_HIGH_PERIOD(value)      (I2C_BUS_CLOCK_HIGH_PERIOD_Msk & ((value) << I2C_BUS_CLOCK_HIGH_PERIOD_Pos))
#define I2C_BUS_CLOCK_Msk                     (0x0000FFFFUL)                                 /**< (I2C_BUS_CLOCK) Register Mask  */

/* -------- I2C_BLOCK_ID : (I2C Offset: 0x30) (R/ 8) Block ID Register -------- */

typedef union
{
  struct
  {
    uint8_t  ID:8;                      /**< bit:   0..7  Block ID.                                     */
  };
  uint8_t  w;
} __I2C_BLOCK_ID_bits_t;
#define I2C_BLOCK_ID_RESETVALUE             (0x00U)                                       /**<  (I2C_BLOCK_ID) Block ID Register  Reset Value */

#define I2C_BLOCK_ID_ID_Pos                   (0)                                            /**< (I2C_BLOCK_ID) Block ID. Position */
#define I2C_BLOCK_ID_ID_Msk                   (0xFFU << I2C_BLOCK_ID_ID_Pos)                 /**< (I2C_BLOCK_ID) Block ID. Mask */
#define I2C_BLOCK_ID_ID(value)                (I2C_BLOCK_ID_ID_Msk & ((value) << I2C_BLOCK_ID_ID_Pos))
#define I2C_BLOCK_ID_Msk                      (0x000000FFUL)                                 /**< (I2C_BLOCK_ID) Register Mask  */

/* -------- I2C_REVISION : (I2C Offset: 0x34) (R/ 8) Revision Register -------- */

typedef union
{
  struct
  {
    uint8_t  REVISION:8;                /**< bit:   0..7  Block Revision Number                         */
  };
  uint8_t  w;
} __I2C_REVISION_bits_t;
#define I2C_REVISION_RESETVALUE             (0x00U)                                       /**<  (I2C_REVISION) Revision Register  Reset Value */

