ranjithaguna/pv/LED_Demo/source/pic32cx/component/i2c.h
#define I2C_REVISION_REVISION_Pos             (0)                                            /**< (I2C_REVISION) Block Revision Number Position */
#define I2C_REVISION_REVISION_Msk             (0xFFU << I2C_REVISION_REVISION_Pos)           /**< (I2C_REVISION) Block Revision Number Mask */
#define I2C_REVISION_REVISION(value)          (I2C_REVISION_REVISION_Msk & ((value) << I2C_REVISION_REVISION_Pos))
#define I2C_REVISION_Msk                      (0x000000FFUL)                                 /**< (I2C_REVISION) Register Mask  */

/* -------- I2C_BIT_BANG_CONTROL : (I2C Offset: 0x38) (R/W 32) Bit-Bang Control Register -------- */

typedef union
{
  struct
  {
    uint32_t BBEN:1;                    /**< bit:      0  Bit-Bang Mode Enable. 0 - Bit Bang Mode Disabled. 1 - Bit Bang Mode Enabled */
    uint32_t CLDIR:1;                   /**< bit:      1  Bit-Bang Clock Direction. The CLDIR bit controls the direction of SCLK. 0 - Input, 1 - Output */
    uint32_t DADIR:1;                   /**< bit:      2  Bit-Bang Data Direction. The DADIR bit controls the direction of SDAT. 0 - Input. 1 - Output */
    uint32_t BBCLK:1;                   /**< bit:      3  Bit-Bang Clock. The BBCLK bit controls the state of SCLK when BBEN = and CLDIR = '1' */
    uint32_t BBDAT:1;                   /**< bit:      4  Bit-Bang Data. The BBDAT bit controls the state of SDAT when BBEN = and DADIR = '1' */
    uint32_t BBCLKI:1;                  /**< bit:      5  Bit-Bang Clock In. The BBCLKI bit always returns the state of SCLK. */
    uint32_t BBDATI:1;                  /**< bit:      6  Bit-Bang Data In. The BBDATI bit always returns the state of SDAT */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __I2C_BIT_BANG_CONTROL_bits_t;
#define I2C_BIT_BANG_CONTROL_RESETVALUE     (0x60U)                                       /**<  (I2C_BIT_BANG_CONTROL) Bit-Bang Control Register  Reset Value */

#define I2C_BIT_BANG_CONTROL_BBEN_Pos         (0)                                            /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Mode Enable. 0 - Bit Bang Mode Disabled. 1 - Bit Bang Mode Enabled Position */
#define I2C_BIT_BANG_CONTROL_BBEN_Msk         (0x1U << I2C_BIT_BANG_CONTROL_BBEN_Pos)        /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Mode Enable. 0 - Bit Bang Mode Disabled. 1 - Bit Bang Mode Enabled Mask */
#define I2C_BIT_BANG_CONTROL_CLDIR_Pos        (1)                                            /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Clock Direction. The CLDIR bit controls the direction of SCLK. 0 - Input, 1 - Output Position */
#define I2C_BIT_BANG_CONTROL_CLDIR_Msk        (0x1U << I2C_BIT_BANG_CONTROL_CLDIR_Pos)       /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Clock Direction. The CLDIR bit controls the direction of SCLK. 0 - Input, 1 - Output Mask */
#define I2C_BIT_BANG_CONTROL_DADIR_Pos        (2)                                            /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Data Direction. The DADIR bit controls the direction of SDAT. 0 - Input. 1 - Output Position */
#define I2C_BIT_BANG_CONTROL_DADIR_Msk        (0x1U << I2C_BIT_BANG_CONTROL_DADIR_Pos)       /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Data Direction. The DADIR bit controls the direction of SDAT. 0 - Input. 1 - Output Mask */
#define I2C_BIT_BANG_CONTROL_BBCLK_Pos        (3)                                            /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Clock. The BBCLK bit controls the state of SCLK when BBEN = and CLDIR = '1' Position */
#define I2C_BIT_BANG_CONTROL_BBCLK_Msk        (0x1U << I2C_BIT_BANG_CONTROL_BBCLK_Pos)       /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Clock. The BBCLK bit controls the state of SCLK when BBEN = and CLDIR = '1' Mask */
#define I2C_BIT_BANG_CONTROL_BBDAT_Pos        (4)                                            /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Data. The BBDAT bit controls the state of SDAT when BBEN = and DADIR = '1' Position */
#define I2C_BIT_BANG_CONTROL_BBDAT_Msk        (0x1U << I2C_BIT_BANG_CONTROL_BBDAT_Pos)       /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Data. The BBDAT bit controls the state of SDAT when BBEN = and DADIR = '1' Mask */
#define I2C_BIT_BANG_CONTROL_BBCLKI_Pos       (5)                                            /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Clock In. The BBCLKI bit always returns the state of SCLK. Position */
#define I2C_BIT_BANG_CONTROL_BBCLKI_Msk       (0x1U << I2C_BIT_BANG_CONTROL_BBCLKI_Pos)      /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Clock In. The BBCLKI bit always returns the state of SCLK. Mask */
#define I2C_BIT_BANG_CONTROL_BBDATI_Pos       (6)                                            /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Data In. The BBDATI bit always returns the state of SDAT Position */
#define I2C_BIT_BANG_CONTROL_BBDATI_Msk       (0x1U << I2C_BIT_BANG_CONTROL_BBDATI_Pos)      /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Data In. The BBDATI bit always returns the state of SDAT Mask */
#define I2C_BIT_BANG_CONTROL_Msk              (0x0000007FUL)                                 /**< (I2C_BIT_BANG_CONTROL) Register Mask  */

/* -------- I2C_CLK_SYNC_REG : (I2C Offset: 0x3c) (R/ 8) This is Clock Sync Register. This register must not be written, or undesirable results may occur.\n -------- */

typedef union
{
  struct
  {
    uint8_t  CLK_SYNC:8;                /**< bit:   0..7  This register must not be written, or undesirable results may occur. */
  };
  uint8_t  w;
} __I2C_CLK_SYNC_REG_bits_t;
#define I2C_CLK_SYNC_REG_RESETVALUE         (0x00U)                                       /**<  (I2C_CLK_SYNC_REG) This is Clock Sync Register. This register must not be written, or undesirable results may occur.\n  Reset Value */

#define I2C_CLK_SYNC_REG_CLK_SYNC_Pos         (0)                                            /**< (I2C_CLK_SYNC_REG) This register must not be written, or undesirable results may occur. Position */
#define I2C_CLK_SYNC_REG_CLK_SYNC_Msk         (0xFFU << I2C_CLK_SYNC_REG_CLK_SYNC_Pos)       /**< (I2C_CLK_SYNC_REG) This register must not be written, or undesirable results may occur. Mask */
#define I2C_CLK_SYNC_REG_CLK_SYNC(value)      (I2C_CLK_SYNC_REG_CLK_SYNC_Msk & ((value) << I2C_CLK_SYNC_REG_CLK_SYNC_Pos))
#define I2C_CLK_SYNC_REG_Msk                  (0x000000FFUL)                                 /**< (I2C_CLK_SYNC_REG) Register Mask  */

/* -------- I2C_DATA_TIMING : (I2C Offset: 0x40) (R/W 32) Data Timing Register -------- */

typedef union
{
  struct
  {
    uint32_t DATA_HOLD:8;               /**< bit:   0..7  The Data Hold [7:0] timer determines the SDAT hold time following SCLK driven low. */
    uint32_t RESTART_SETUP:8;           /**< bit:  8..15  The Restart Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a repeated START condition. */
    uint32_t STOP_SETUP:8;              /**< bit: 16..23  The Stop Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a STOP condition. */
    uint32_t FIRST_START_HOLD:8;        /**< bit: 24..31  This field determines the SCL hold time following SDA driven low during the first START bit in a transfer. It is the parameter\n      THD:STA in the I2C Specification for an initial START bit. Repeated START hold time is determined by the Repeated START Hold Time Register. */
  };
  uint32_t w;
} __I2C_DATA_TIMING_bits_t;
#define I2C_DATA_TIMING_RESETVALUE          (0xC4D5006U)                                  /**<  (I2C_DATA_TIMING) Data Timing Register  Reset Value */

#define I2C_DATA_TIMING_DATA_HOLD_Pos         (0)                                            /**< (I2C_DATA_TIMING) The Data Hold [7:0] timer determines the SDAT hold time following SCLK driven low. Position */
#define I2C_DATA_TIMING_DATA_HOLD_Msk         (0xFFU << I2C_DATA_TIMING_DATA_HOLD_Pos)       /**< (I2C_DATA_TIMING) The Data Hold [7:0] timer determines the SDAT hold time following SCLK driven low. Mask */
#define I2C_DATA_TIMING_DATA_HOLD(value)      (I2C_DATA_TIMING_DATA_HOLD_Msk & ((value) << I2C_DATA_TIMING_DATA_HOLD_Pos))
#define I2C_DATA_TIMING_RESTART_SETUP_Pos     (8)                                            /**< (I2C_DATA_TIMING) The Restart Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a repeated START condition. Position */
#define I2C_DATA_TIMING_RESTART_SETUP_Msk     (0xFFU << I2C_DATA_TIMING_RESTART_SETUP_Pos)   /**< (I2C_DATA_TIMING) The Restart Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a repeated START condition. Mask */
#define I2C_DATA_TIMING_RESTART_SETUP(value)  (I2C_DATA_TIMING_RESTART_SETUP_Msk & ((value) << I2C_DATA_TIMING_RESTART_SETUP_Pos))
#define I2C_DATA_TIMING_STOP_SETUP_Pos        (16)                                           /**< (I2C_DATA_TIMING) The Stop Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a STOP condition. Position */
#define I2C_DATA_TIMING_STOP_SETUP_Msk        (0xFFU << I2C_DATA_TIMING_STOP_SETUP_Pos)      /**< (I2C_DATA_TIMING) The Stop Setup [7:0] timer determines the SDAT setup time from the rising edge of SCLK for a STOP condition. Mask */
#define I2C_DATA_TIMING_STOP_SETUP(value)     (I2C_DATA_TIMING_STOP_SETUP_Msk & ((value) << I2C_DATA_TIMING_STOP_SETUP_Pos))
#define I2C_DATA_TIMING_FIRST_START_HOLD_Pos  (24)                                           /**< (I2C_DATA_TIMING) This field determines the SCL hold time following SDA driven low during the first START bit in a transfer. It is the parameter\n      THD:STA in the I2C Specification for an initial START bit. Repeated START hold time is determined by the Repeated START Hold Time Register. Position */
#define I2C_DATA_TIMING_FIRST_START_HOLD_Msk  (0xFFU << I2C_DATA_TIMING_FIRST_START_HOLD_Pos)  /**< (I2C_DATA_TIMING) This field determines the SCL hold time following SDA driven low during the first START bit in a transfer. It is the parameter\n      THD:STA in the I2C Specification for an initial START bit. Repeated START hold time is determined by the Repeated START Hold Time Register. Mask */
#define I2C_DATA_TIMING_FIRST_START_HOLD(value) (I2C_DATA_TIMING_FIRST_START_HOLD_Msk & ((value) << I2C_DATA_TIMING_FIRST_START_HOLD_Pos))
#define I2C_DATA_TIMING_Msk                   (0xFFFFFFFFUL)                                 /**< (I2C_DATA_TIMING) Register Mask  */

/* -------- I2C_TIME_OUT_SCALING : (I2C Offset: 0x44) (R/W 32) Time-Out Scaling Register -------- */

typedef union
{
  struct
  {
    uint32_t :24;                       /**< bit:  0..23  Reserved                                      */
    uint32_t BUS_IDLE_MIN:8;            /**< bit: 24..31  Bus Idle Minimum time = Bus Idle Min [7:0] x Baud_Clock_Period */
  };
  uint32_t w;
} __I2C_TIME_OUT_SCALING_bits_t;
#define I2C_TIME_OUT_SCALING_RESETVALUE     (0x4B9CC2C7U)                                 /**<  (I2C_TIME_OUT_SCALING) Time-Out Scaling Register  Reset Value */

#define I2C_TIME_OUT_SCALING_BUS_IDLE_MIN_Pos (24)                                           /**< (I2C_TIME_OUT_SCALING) Bus Idle Minimum time = Bus Idle Min [7:0] x Baud_Clock_Period Position */
#define I2C_TIME_OUT_SCALING_BUS_IDLE_MIN_Msk (0xFFU << I2C_TIME_OUT_SCALING_BUS_IDLE_MIN_Pos)  /**< (I2C_TIME_OUT_SCALING) Bus Idle Minimum time = Bus Idle Min [7:0] x Baud_Clock_Period Mask */
#define I2C_TIME_OUT_SCALING_BUS_IDLE_MIN(value) (I2C_TIME_OUT_SCALING_BUS_IDLE_MIN_Msk & ((value) << I2C_TIME_OUT_SCALING_BUS_IDLE_MIN_Pos))
#define I2C_TIME_OUT_SCALING_Msk              (0xFF000000UL)                                 /**< (I2C_TIME_OUT_SCALING) Register Mask  */

/* -------- I2C_WAKE_STATUS : (I2C Offset: 0x60) (R/W 32) WAKE STATUS Register -------- */

typedef union
{
  struct
  {
    uint32_t START_BIT_DETECTION:1;     /**< bit:      0  This bit is set to '1' when a START bit is detected while the controller is enabled. This bit is cleared to '0' when\n      written with a '1'. Writes of '0' have no effect. (R/WC) */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __I2C_WAKE_STATUS_bits_t;
