ranjithaguna/pv/LED_Demo/source/pic32cx/component/i2c.h
#define I2C_WAKE_STATUS_RESETVALUE          (0x00U)                                       /**<  (I2C_WAKE_STATUS) WAKE STATUS Register  Reset Value */

#define I2C_WAKE_STATUS_START_BIT_DETECTION_Pos (0)                                            /**< (I2C_WAKE_STATUS) This bit is set to '1' when a START bit is detected while the controller is enabled. This bit is cleared to '0' when\n      written with a '1'. Writes of '0' have no effect. (R/WC) Position */
#define I2C_WAKE_STATUS_START_BIT_DETECTION_Msk (0x1U << I2C_WAKE_STATUS_START_BIT_DETECTION_Pos)  /**< (I2C_WAKE_STATUS) This bit is set to '1' when a START bit is detected while the controller is enabled. This bit is cleared to '0' when\n      written with a '1'. Writes of '0' have no effect. (R/WC) Mask */
#define I2C_WAKE_STATUS_Msk                   (0x00000001UL)                                 /**< (I2C_WAKE_STATUS) Register Mask  */

/* -------- I2C_WAKE_ENABLE : (I2C Offset: 0x64) (R/W 32) WAKE ENABLE Register -------- */

typedef union
{
  struct
  {
    uint32_t START_DETECT_INT_EN:1;     /**< bit:      0  Enable Start Bit Detection Interrupt. The Start Bit Detection Interrupt is wake-capable.\n         1=Start Bit Detection Interrupt enabled. \n         0=Start Bit Detection Interrupt disabled.\n */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __I2C_WAKE_ENABLE_bits_t;
#define I2C_WAKE_ENABLE_RESETVALUE          (0x00U)                                       /**<  (I2C_WAKE_ENABLE) WAKE ENABLE Register  Reset Value */

#define I2C_WAKE_ENABLE_START_DETECT_INT_EN_Pos (0)                                            /**< (I2C_WAKE_ENABLE) Enable Start Bit Detection Interrupt. The Start Bit Detection Interrupt is wake-capable.\n         1=Start Bit Detection Interrupt enabled. \n         0=Start Bit Detection Interrupt disabled.\n Position */
#define I2C_WAKE_ENABLE_START_DETECT_INT_EN_Msk (0x1U << I2C_WAKE_ENABLE_START_DETECT_INT_EN_Pos)  /**< (I2C_WAKE_ENABLE) Enable Start Bit Detection Interrupt. The Start Bit Detection Interrupt is wake-capable.\n         1=Start Bit Detection Interrupt enabled. \n         0=Start Bit Detection Interrupt disabled.\n Mask */
#define I2C_WAKE_ENABLE_Msk                   (0x00000001UL)                                 /**< (I2C_WAKE_ENABLE) Register Mask  */

/* -------- I2C_SLAVE_ADDRESS : (I2C Offset: 0x6c) (R/W 8) This is the Slave Address Register.\n -------- */

typedef union
{
  struct
  {
    uint8_t  SLAVEADD:8;                /**< bit:   0..7  This register stores the value of the Slave Address and Direction Bit from the 1st byte of a Slave transfer.\n    This is loaded immediately upon receipt of the address byte, before the ACK/NAK 9th clock. \n */
  };
  uint8_t  w;
} __I2C_SLAVE_ADDRESS_bits_t;
#define I2C_SLAVE_ADDRESS_RESETVALUE        (0x00U)                                       /**<  (I2C_SLAVE_ADDRESS) This is the Slave Address Register.\n  Reset Value */

#define I2C_SLAVE_ADDRESS_SLAVEADD_Pos        (0)                                            /**< (I2C_SLAVE_ADDRESS) This register stores the value of the Slave Address and Direction Bit from the 1st byte of a Slave transfer.\n    This is loaded immediately upon receipt of the address byte, before the ACK/NAK 9th clock. \n Position */
#define I2C_SLAVE_ADDRESS_SLAVEADD_Msk        (0xFFU << I2C_SLAVE_ADDRESS_SLAVEADD_Pos)      /**< (I2C_SLAVE_ADDRESS) This register stores the value of the Slave Address and Direction Bit from the 1st byte of a Slave transfer.\n    This is loaded immediately upon receipt of the address byte, before the ACK/NAK 9th clock. \n Mask */
#define I2C_SLAVE_ADDRESS_SLAVEADD(value)     (I2C_SLAVE_ADDRESS_SLAVEADD_Msk & ((value) << I2C_SLAVE_ADDRESS_SLAVEADD_Pos))
#define I2C_SLAVE_ADDRESS_Msk                 (0x000000FFUL)                                 /**< (I2C_SLAVE_ADDRESS) Register Mask  */

/* -------- I2C_PROMISCUOUS_INT : (I2C Offset: 0x70) (R/W 8) This is the Promiscuous Interrupt Register. This register bit will be functional only in Promiscuous mode.\n -------- */

typedef union
{
  struct
  {
    uint8_t  PROMISCUOUS_ADDSTAT:1;     /**< bit:      0  This is the Promiscuous Address Status interrupt. This bit is functional only in Promiscuous mode. This bit is set \n         on the 8th clock of the I2C Address. This bit will hold the Clock line low till this register bit is cleared. In other words, \n         Software should read the address program ACK/NAK and clear this bit for the ACK/NAK clock to appear on the I2C clock (SCL) line. \n         This is Write 1 to clear. R/W1C. */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __I2C_PROMISCUOUS_INT_bits_t;
#define I2C_PROMISCUOUS_INT_RESETVALUE      (0x00U)                                       /**<  (I2C_PROMISCUOUS_INT) This is the Promiscuous Interrupt Register. This register bit will be functional only in Promiscuous mode.\n  Reset Value */

#define I2C_PROMISCUOUS_INT_PROMISCUOUS_ADDSTAT_Pos (0)                                            /**< (I2C_PROMISCUOUS_INT) This is the Promiscuous Address Status interrupt. This bit is functional only in Promiscuous mode. This bit is set \n         on the 8th clock of the I2C Address. This bit will hold the Clock line low till this register bit is cleared. In other words, \n         Software should read the address program ACK/NAK and clear this bit for the ACK/NAK clock to appear on the I2C clock (SCL) line. \n         This is Write 1 to clear. R/W1C. Position */
#define I2C_PROMISCUOUS_INT_PROMISCUOUS_ADDSTAT_Msk (0x1U << I2C_PROMISCUOUS_INT_PROMISCUOUS_ADDSTAT_Pos)  /**< (I2C_PROMISCUOUS_INT) This is the Promiscuous Address Status interrupt. This bit is functional only in Promiscuous mode. This bit is set \n         on the 8th clock of the I2C Address. This bit will hold the Clock line low till this register bit is cleared. In other words, \n         Software should read the address program ACK/NAK and clear this bit for the ACK/NAK clock to appear on the I2C clock (SCL) line. \n         This is Write 1 to clear. R/W1C. Mask */
#define I2C_PROMISCUOUS_INT_Msk               (0x00000001UL)                                 /**< (I2C_PROMISCUOUS_INT) Register Mask  */

/* -------- I2C_PROMIS_INTEN : (I2C Offset: 0x74) (R/W 8) This is the Promiscuous Interrupt Enable Register.\n -------- */

typedef union
{
  struct
  {
    uint8_t  PROMIS_ADDSTAT_INTEN:1;    /**< bit:      0  This is the Promiscuous interrupt enable register.\n         1= Interrupt Enable. \n         0= Interrupt Disabled. \n */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __I2C_PROMIS_INTEN_bits_t;
