ranjithaguna/pv/LED_Demo/source/pic32cx/component/i2c.h
#define I2C_PROMIS_INTEN_RESETVALUE         (0x00U)                                       /**<  (I2C_PROMIS_INTEN) This is the Promiscuous Interrupt Enable Register.\n  Reset Value */

#define I2C_PROMIS_INTEN_PROMIS_ADDSTAT_INTEN_Pos (0)                                            /**< (I2C_PROMIS_INTEN) This is the Promiscuous interrupt enable register.\n         1= Interrupt Enable. \n         0= Interrupt Disabled. \n Position */
#define I2C_PROMIS_INTEN_PROMIS_ADDSTAT_INTEN_Msk (0x1U << I2C_PROMIS_INTEN_PROMIS_ADDSTAT_INTEN_Pos)  /**< (I2C_PROMIS_INTEN) This is the Promiscuous interrupt enable register.\n         1= Interrupt Enable. \n         0= Interrupt Disabled. \n Mask */
#define I2C_PROMIS_INTEN_Msk                  (0x00000001UL)                                 /**< (I2C_PROMIS_INTEN) Register Mask  */

/* -------- I2C_PROMIS_CTRL : (I2C Offset: 0x78) (R/W 8) This is the Promiscuous Control Register. This register is functional only in Promiscuous mode.\n -------- */

typedef union
{
  struct
  {
    uint8_t  PROMIS_ACK_NAK:1;          /**< bit:      0  This is the Promiscuous ACK / NAK response register. This bit has no effect in Normal mode of operation.\n         1= ACK the address byte. \n         0= NAK the address byte. \n */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __I2C_PROMIS_CTRL_bits_t;
#define I2C_PROMIS_CTRL_RESETVALUE          (0x00U)                                       /**<  (I2C_PROMIS_CTRL) This is the Promiscuous Control Register. This register is functional only in Promiscuous mode.\n  Reset Value */

#define I2C_PROMIS_CTRL_PROMIS_ACK_NAK_Pos    (0)                                            /**< (I2C_PROMIS_CTRL) This is the Promiscuous ACK / NAK response register. This bit has no effect in Normal mode of operation.\n         1= ACK the address byte. \n         0= NAK the address byte. \n Position */
#define I2C_PROMIS_CTRL_PROMIS_ACK_NAK_Msk    (0x1U << I2C_PROMIS_CTRL_PROMIS_ACK_NAK_Pos)   /**< (I2C_PROMIS_CTRL) This is the Promiscuous ACK / NAK response register. This bit has no effect in Normal mode of operation.\n         1= ACK the address byte. \n         0= NAK the address byte. \n Mask */
#define I2C_PROMIS_CTRL_Msk                   (0x00000001UL)                                 /**< (I2C_PROMIS_CTRL) Register Mask  */

/** \brief I2C register offsets definitions */
#define I2C_CONTROL_OFFSET           (0x00)         /**< (I2C_CONTROL) Control Register Offset */
#define I2C_OWN_OFFSET               (0x04)         /**< (I2C_OWN) Own Address Register\n           Note that the Data Register and Own Address fields are offset by one bit, so that programming Own Address 1 with a value of 55h will result in the value AAh being recognized as the SMB Controller Core slave address. Offset */
#define I2C_DATA_REG_OFFSET          (0x08)         /**< (I2C_DATA_REG) This register holds the data that are either shifted out to or shifted in from the I2C port. Offset */
#define I2C_REPEATED_START_HOLD_TIME_OFFSET (0x18)         /**< (I2C_REPEATED_START_HOLD_TIME) Repeated Start Hold Time Register Offset */
#define I2C_COMPLETION_OFFSET        (0x20)         /**< (I2C_COMPLETION) Completion Register Offset */
#define I2C_CONFIGURATION_OFFSET     (0x28)         /**< (I2C_CONFIGURATION) Configuration Register Offset */
#define I2C_BUS_CLOCK_OFFSET         (0x2C)         /**< (I2C_BUS_CLOCK) Bus Clock Register Offset */
#define I2C_BLOCK_ID_OFFSET          (0x30)         /**< (I2C_BLOCK_ID) Block ID Register Offset */
#define I2C_REVISION_OFFSET          (0x34)         /**< (I2C_REVISION) Revision Register Offset */
#define I2C_BIT_BANG_CONTROL_OFFSET  (0x38)         /**< (I2C_BIT_BANG_CONTROL) Bit-Bang Control Register Offset */
#define I2C_CLK_SYNC_REG_OFFSET      (0x3C)         /**< (I2C_CLK_SYNC_REG) This is Clock Sync Register. This register must not be written, or undesirable results may occur.\n Offset */
#define I2C_DATA_TIMING_OFFSET       (0x40)         /**< (I2C_DATA_TIMING) Data Timing Register Offset */
#define I2C_TIME_OUT_SCALING_OFFSET  (0x44)         /**< (I2C_TIME_OUT_SCALING) Time-Out Scaling Register Offset */
#define I2C_WAKE_STATUS_OFFSET       (0x60)         /**< (I2C_WAKE_STATUS) WAKE STATUS Register Offset */
#define I2C_WAKE_ENABLE_OFFSET       (0x64)         /**< (I2C_WAKE_ENABLE) WAKE ENABLE Register Offset */
#define I2C_SLAVE_ADDRESS_OFFSET     (0x6C)         /**< (I2C_SLAVE_ADDRESS) This is the Slave Address Register.\n Offset */
#define I2C_PROMISCUOUS_INT_OFFSET   (0x70)         /**< (I2C_PROMISCUOUS_INT) This is the Promiscuous Interrupt Register. This register bit will be functional only in Promiscuous mode.\n Offset */
#define I2C_PROMIS_INTEN_OFFSET      (0x74)         /**< (I2C_PROMIS_INTEN) This is the Promiscuous Interrupt Enable Register.\n Offset */
#define I2C_PROMIS_CTRL_OFFSET       (0x78)         /**< (I2C_PROMIS_CTRL) This is the Promiscuous Control Register. This register is functional only in Promiscuous mode.\n Offset */

/** \brief I2C register API structure */
typedef struct
{  /* The I2C interface can handle standard I2C interface. */
  __O   __I2C_CONTROL_bits_t           CONTROL;       /**< Offset: 0x00 ( /W  32) Control Register */
  __I   __I2C_STATUS_bits_t            STATUS;        /**< Offset: 0x00 (R/   32) Status Register */
  __IO  __I2C_OWN_bits_t               OWN;           /**< Offset: 0x04 (R/W  32) Own Address Register\n           Note that the Data Register and Own Address fields are offset by one bit, so that programming Own Address 1 with a value of 55h will result in the value AAh being recognized as the SMB Controller Core slave address. */
  __IO  __I2C_DATA_REG_bits_t          DATA_REG;      /**< Offset: 0x08 (R/W   8) This register holds the data that are either shifted out to or shifted in from the I2C port. */
  __IO  __I2C_REPEATED_START_HOLD_TIME_bits_t REPEATED_START_HOLD_TIME; /**< Offset: 0x18 (R/W  32) Repeated Start Hold Time Register */
  __IO  __I2C_COMPLETION_bits_t        COMPLETION;    /**< Offset: 0x20 (R/W  32) Completion Register */
  __IO  __I2C_CONFIGURATION_bits_t     CONFIGURATION; /**< Offset: 0x28 (R/W  32) Configuration Register */
  __IO  __I2C_BUS_CLOCK_bits_t         BUS_CLOCK;     /**< Offset: 0x2C (R/W  32) Bus Clock Register */
  __I   __I2C_BLOCK_ID_bits_t          BLOCK_ID;      /**< Offset: 0x30 (R/    8) Block ID Register */
  __I   __I2C_REVISION_bits_t          REVISION;      /**< Offset: 0x34 (R/    8) Revision Register */
  __IO  __I2C_BIT_BANG_CONTROL_bits_t  BIT_BANG_CONTROL; /**< Offset: 0x38 (R/W  32) Bit-Bang Control Register */
  __I   __I2C_CLK_SYNC_REG_bits_t      CLK_SYNC_REG;  /**< Offset: 0x3C (R/    8) This is Clock Sync Register. This register must not be written, or undesirable results may occur.\n */
  __IO  __I2C_DATA_TIMING_bits_t       DATA_TIMING;   /**< Offset: 0x40 (R/W  32) Data Timing Register */
  __IO  __I2C_TIME_OUT_SCALING_bits_t  TIME_OUT_SCALING; /**< Offset: 0x44 (R/W  32) Time-Out Scaling Register */
  __IO  __I2C_WAKE_STATUS_bits_t       WAKE_STATUS;   /**< Offset: 0x60 (R/W  32) WAKE STATUS Register */
  __IO  __I2C_WAKE_ENABLE_bits_t       WAKE_ENABLE;   /**< Offset: 0x64 (R/W  32) WAKE ENABLE Register */
  __IO  __I2C_SLAVE_ADDRESS_bits_t     SLAVE_ADDRESS; /**< Offset: 0x6C (R/W   8) This is the Slave Address Register.\n */
  __IO  __I2C_PROMISCUOUS_INT_bits_t   PROMISCUOUS_INT; /**< Offset: 0x70 (R/W   8) This is the Promiscuous Interrupt Register. This register bit will be functional only in Promiscuous mode.\n */
  __IO  __I2C_PROMIS_INTEN_bits_t      PROMIS_INTEN;  /**< Offset: 0x74 (R/W   8) This is the Promiscuous Interrupt Enable Register.\n */
  __IO  __I2C_PROMIS_CTRL_bits_t       PROMIS_CTRL;   /**< Offset: 0x78 (R/W   8) This is the Promiscuous Control Register. This register is functional only in Promiscuous mode.\n */
} i2c_registers_t;
/** @}  end of The I2C interface can handle standard I2C interface. */

#endif /* _PIC32CX_0525SG12_I2C_COMPONENT_H_ */
